SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG22/Include/efr32bg22_protimer.h
/* Bit fields for PROTIMER TOUT1CNTTOP */
#define _PROTIMER_TOUT1CNTTOP_RESETVALUE                 0x00FF00FFUL                                      /**< Default value for PROTIMER_TOUT1CNTTOP      */
#define _PROTIMER_TOUT1CNTTOP_MASK                       0xFFFFFFFFUL                                      /**< Mask for PROTIMER_TOUT1CNTTOP               */
#define _PROTIMER_TOUT1CNTTOP_TOUT1PCNTTOP_SHIFT         0                                                 /**< Shift value for PROTIMER_TOUT1PCNTTOP       */
#define _PROTIMER_TOUT1CNTTOP_TOUT1PCNTTOP_MASK          0xFFFFUL                                          /**< Bit mask for PROTIMER_TOUT1PCNTTOP          */
#define _PROTIMER_TOUT1CNTTOP_TOUT1PCNTTOP_DEFAULT       0x000000FFUL                                      /**< Mode DEFAULT for PROTIMER_TOUT1CNTTOP       */
#define PROTIMER_TOUT1CNTTOP_TOUT1PCNTTOP_DEFAULT        (_PROTIMER_TOUT1CNTTOP_TOUT1PCNTTOP_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_TOUT1CNTTOP*/
#define _PROTIMER_TOUT1CNTTOP_TOUT1CNTTOP_SHIFT          16                                                /**< Shift value for PROTIMER_TOUT1CNTTOP        */
#define _PROTIMER_TOUT1CNTTOP_TOUT1CNTTOP_MASK           0xFFFF0000UL                                      /**< Bit mask for PROTIMER_TOUT1CNTTOP           */
#define _PROTIMER_TOUT1CNTTOP_TOUT1CNTTOP_DEFAULT        0x000000FFUL                                      /**< Mode DEFAULT for PROTIMER_TOUT1CNTTOP       */
#define PROTIMER_TOUT1CNTTOP_TOUT1CNTTOP_DEFAULT         (_PROTIMER_TOUT1CNTTOP_TOUT1CNTTOP_DEFAULT << 16) /**< Shifted mode DEFAULT for PROTIMER_TOUT1CNTTOP*/

/* Bit fields for PROTIMER TOUT1COMP */
#define _PROTIMER_TOUT1COMP_RESETVALUE                   0x00000000UL                                     /**< Default value for PROTIMER_TOUT1COMP        */
#define _PROTIMER_TOUT1COMP_MASK                         0xFFFFFFFFUL                                     /**< Mask for PROTIMER_TOUT1COMP                 */
#define _PROTIMER_TOUT1COMP_TOUT1PCNTCOMP_SHIFT          0                                                /**< Shift value for PROTIMER_TOUT1PCNTCOMP      */
#define _PROTIMER_TOUT1COMP_TOUT1PCNTCOMP_MASK           0xFFFFUL                                         /**< Bit mask for PROTIMER_TOUT1PCNTCOMP         */
#define _PROTIMER_TOUT1COMP_TOUT1PCNTCOMP_DEFAULT        0x00000000UL                                     /**< Mode DEFAULT for PROTIMER_TOUT1COMP         */
#define PROTIMER_TOUT1COMP_TOUT1PCNTCOMP_DEFAULT         (_PROTIMER_TOUT1COMP_TOUT1PCNTCOMP_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_TOUT1COMP */
#define _PROTIMER_TOUT1COMP_TOUT1CNTCOMP_SHIFT           16                                               /**< Shift value for PROTIMER_TOUT1CNTCOMP       */
#define _PROTIMER_TOUT1COMP_TOUT1CNTCOMP_MASK            0xFFFF0000UL                                     /**< Bit mask for PROTIMER_TOUT1CNTCOMP          */
#define _PROTIMER_TOUT1COMP_TOUT1CNTCOMP_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for PROTIMER_TOUT1COMP         */
#define PROTIMER_TOUT1COMP_TOUT1CNTCOMP_DEFAULT          (_PROTIMER_TOUT1COMP_TOUT1CNTCOMP_DEFAULT << 16) /**< Shifted mode DEFAULT for PROTIMER_TOUT1COMP */

/* Bit fields for PROTIMER LBTCTRL */
#define _PROTIMER_LBTCTRL_RESETVALUE                     0x00000000UL                                   /**< Default value for PROTIMER_LBTCTRL          */
#define _PROTIMER_LBTCTRL_MASK                           0x0F1F1FFFUL                                   /**< Mask for PROTIMER_LBTCTRL                   */
#define _PROTIMER_LBTCTRL_STARTEXP_SHIFT                 0                                              /**< Shift value for PROTIMER_STARTEXP           */
#define _PROTIMER_LBTCTRL_STARTEXP_MASK                  0xFUL                                          /**< Bit mask for PROTIMER_STARTEXP              */
#define _PROTIMER_LBTCTRL_STARTEXP_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for PROTIMER_LBTCTRL           */
#define _PROTIMER_LBTCTRL_STARTEXP_EXP0                  0x00000000UL                                   /**< Mode EXP0 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_STARTEXP_EXP1                  0x00000001UL                                   /**< Mode EXP1 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_STARTEXP_EXP2                  0x00000002UL                                   /**< Mode EXP2 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_STARTEXP_EXP3                  0x00000003UL                                   /**< Mode EXP3 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_STARTEXP_EXP4                  0x00000004UL                                   /**< Mode EXP4 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_STARTEXP_EXP5                  0x00000005UL                                   /**< Mode EXP5 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_STARTEXP_EXP6                  0x00000006UL                                   /**< Mode EXP6 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_STARTEXP_EXP7                  0x00000007UL                                   /**< Mode EXP7 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_STARTEXP_EXP8                  0x00000008UL                                   /**< Mode EXP8 for PROTIMER_LBTCTRL              */
#define PROTIMER_LBTCTRL_STARTEXP_DEFAULT                (_PROTIMER_LBTCTRL_STARTEXP_DEFAULT << 0)      /**< Shifted mode DEFAULT for PROTIMER_LBTCTRL   */
#define PROTIMER_LBTCTRL_STARTEXP_EXP0                   (_PROTIMER_LBTCTRL_STARTEXP_EXP0 << 0)         /**< Shifted mode EXP0 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_STARTEXP_EXP1                   (_PROTIMER_LBTCTRL_STARTEXP_EXP1 << 0)         /**< Shifted mode EXP1 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_STARTEXP_EXP2                   (_PROTIMER_LBTCTRL_STARTEXP_EXP2 << 0)         /**< Shifted mode EXP2 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_STARTEXP_EXP3                   (_PROTIMER_LBTCTRL_STARTEXP_EXP3 << 0)         /**< Shifted mode EXP3 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_STARTEXP_EXP4                   (_PROTIMER_LBTCTRL_STARTEXP_EXP4 << 0)         /**< Shifted mode EXP4 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_STARTEXP_EXP5                   (_PROTIMER_LBTCTRL_STARTEXP_EXP5 << 0)         /**< Shifted mode EXP5 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_STARTEXP_EXP6                   (_PROTIMER_LBTCTRL_STARTEXP_EXP6 << 0)         /**< Shifted mode EXP6 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_STARTEXP_EXP7                   (_PROTIMER_LBTCTRL_STARTEXP_EXP7 << 0)         /**< Shifted mode EXP7 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_STARTEXP_EXP8                   (_PROTIMER_LBTCTRL_STARTEXP_EXP8 << 0)         /**< Shifted mode EXP8 for PROTIMER_LBTCTRL      */
#define _PROTIMER_LBTCTRL_MAXEXP_SHIFT                   4                                              /**< Shift value for PROTIMER_MAXEXP             */
#define _PROTIMER_LBTCTRL_MAXEXP_MASK                    0xF0UL                                         /**< Bit mask for PROTIMER_MAXEXP                */
#define _PROTIMER_LBTCTRL_MAXEXP_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for PROTIMER_LBTCTRL           */
#define _PROTIMER_LBTCTRL_MAXEXP_EXP0                    0x00000000UL                                   /**< Mode EXP0 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_MAXEXP_EXP1                    0x00000001UL                                   /**< Mode EXP1 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_MAXEXP_EXP2                    0x00000002UL                                   /**< Mode EXP2 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_MAXEXP_EXP3                    0x00000003UL                                   /**< Mode EXP3 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_MAXEXP_EXP4                    0x00000004UL                                   /**< Mode EXP4 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_MAXEXP_EXP5                    0x00000005UL                                   /**< Mode EXP5 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_MAXEXP_EXP6                    0x00000006UL                                   /**< Mode EXP6 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_MAXEXP_EXP7                    0x00000007UL                                   /**< Mode EXP7 for PROTIMER_LBTCTRL              */
#define _PROTIMER_LBTCTRL_MAXEXP_EXP8                    0x00000008UL                                   /**< Mode EXP8 for PROTIMER_LBTCTRL              */
#define PROTIMER_LBTCTRL_MAXEXP_DEFAULT                  (_PROTIMER_LBTCTRL_MAXEXP_DEFAULT << 4)        /**< Shifted mode DEFAULT for PROTIMER_LBTCTRL   */
#define PROTIMER_LBTCTRL_MAXEXP_EXP0                     (_PROTIMER_LBTCTRL_MAXEXP_EXP0 << 4)           /**< Shifted mode EXP0 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_MAXEXP_EXP1                     (_PROTIMER_LBTCTRL_MAXEXP_EXP1 << 4)           /**< Shifted mode EXP1 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_MAXEXP_EXP2                     (_PROTIMER_LBTCTRL_MAXEXP_EXP2 << 4)           /**< Shifted mode EXP2 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_MAXEXP_EXP3                     (_PROTIMER_LBTCTRL_MAXEXP_EXP3 << 4)           /**< Shifted mode EXP3 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_MAXEXP_EXP4                     (_PROTIMER_LBTCTRL_MAXEXP_EXP4 << 4)           /**< Shifted mode EXP4 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_MAXEXP_EXP5                     (_PROTIMER_LBTCTRL_MAXEXP_EXP5 << 4)           /**< Shifted mode EXP5 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_MAXEXP_EXP6                     (_PROTIMER_LBTCTRL_MAXEXP_EXP6 << 4)           /**< Shifted mode EXP6 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_MAXEXP_EXP7                     (_PROTIMER_LBTCTRL_MAXEXP_EXP7 << 4)           /**< Shifted mode EXP7 for PROTIMER_LBTCTRL      */
#define PROTIMER_LBTCTRL_MAXEXP_EXP8                     (_PROTIMER_LBTCTRL_MAXEXP_EXP8 << 4)           /**< Shifted mode EXP8 for PROTIMER_LBTCTRL      */
#define _PROTIMER_LBTCTRL_CCADELAY_SHIFT                 8                                              /**< Shift value for PROTIMER_CCADELAY           */
#define _PROTIMER_LBTCTRL_CCADELAY_MASK                  0x1F00UL                                       /**< Bit mask for PROTIMER_CCADELAY              */
#define _PROTIMER_LBTCTRL_CCADELAY_DEFAULT               0x00000000UL                                   /**< Mode DEFAULT for PROTIMER_LBTCTRL           */
#define PROTIMER_LBTCTRL_CCADELAY_DEFAULT                (_PROTIMER_LBTCTRL_CCADELAY_DEFAULT << 8)      /**< Shifted mode DEFAULT for PROTIMER_LBTCTRL   */
#define _PROTIMER_LBTCTRL_CCAREPEAT_SHIFT                16                                             /**< Shift value for PROTIMER_CCAREPEAT          */
#define _PROTIMER_LBTCTRL_CCAREPEAT_MASK                 0xF0000UL                                      /**< Bit mask for PROTIMER_CCAREPEAT             */
#define _PROTIMER_LBTCTRL_CCAREPEAT_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for PROTIMER_LBTCTRL           */
#define PROTIMER_LBTCTRL_CCAREPEAT_DEFAULT               (_PROTIMER_LBTCTRL_CCAREPEAT_DEFAULT << 16)    /**< Shifted mode DEFAULT for PROTIMER_LBTCTRL   */
#define PROTIMER_LBTCTRL_FIXEDBACKOFF                    (0x1UL << 20)                                  /**< Fixed backoff                               */
#define _PROTIMER_LBTCTRL_FIXEDBACKOFF_SHIFT             20                                             /**< Shift value for PROTIMER_FIXEDBACKOFF       */
#define _PROTIMER_LBTCTRL_FIXEDBACKOFF_MASK              0x100000UL                                     /**< Bit mask for PROTIMER_FIXEDBACKOFF          */
#define _PROTIMER_LBTCTRL_FIXEDBACKOFF_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for PROTIMER_LBTCTRL           */
#define PROTIMER_LBTCTRL_FIXEDBACKOFF_DEFAULT            (_PROTIMER_LBTCTRL_FIXEDBACKOFF_DEFAULT << 20) /**< Shifted mode DEFAULT for PROTIMER_LBTCTRL   */
#define _PROTIMER_LBTCTRL_RETRYLIMIT_SHIFT               24                                             /**< Shift value for PROTIMER_RETRYLIMIT         */
#define _PROTIMER_LBTCTRL_RETRYLIMIT_MASK                0xF000000UL                                    /**< Bit mask for PROTIMER_RETRYLIMIT            */
#define _PROTIMER_LBTCTRL_RETRYLIMIT_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for PROTIMER_LBTCTRL           */
#define PROTIMER_LBTCTRL_RETRYLIMIT_DEFAULT              (_PROTIMER_LBTCTRL_RETRYLIMIT_DEFAULT << 24)   /**< Shifted mode DEFAULT for PROTIMER_LBTCTRL   */

